freebsd-cloud.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-03 二 23:31 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FreeBSD Cloud</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html"> SITEMAP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">FreeBSD Cloud</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc3a5e3a">Setup CloudInit for FreeBSD Image</a>
<ul>
<li><a href="#orga6a107e">Download Image And Convert</a></li>
<li><a href="#orge162ac1">Mount Image And Chroot</a></li>
<li><a href="#orga0f68c7">Install Cloud-init</a></li>
<li><a href="#org4cb7da0">Umount Image And Convert Back</a></li>
<li><a href="#orge7fae91">Boot Instance</a></li>
</ul>
</li>
<li><a href="#orgbc20c73">Disk Resize Under FreeBSD</a>
<ul>
<li><a href="#orgcd9fc1a">List Disks</a></li>
<li><a href="#org41cd46d">Show and Recover if Needed</a></li>
<li><a href="#org418fc14">Resize Partition</a></li>
<li><a href="#org0d9444d">Grow Filesystem</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
How to setup cloudinit for freebsd and how to do disk resize under freebsd.
</p>

<div id="outline-container-orgc3a5e3a" class="outline-2">
<h2 id="orgc3a5e3a">Setup CloudInit for FreeBSD Image</h2>
<div class="outline-text-2" id="text-orgc3a5e3a">
<p>
In this guide we will talk about CloudInit Setup on FreeBSD, not
<code>bsd-cloudinit</code>. It's because <code>bsd-cloudinit</code> is based on
<code>cloudbaseinit</code>, which has no support on <code>ConfigDrive</code>, while our
OpenStack cloud supports only <code>ConfigDrive</code>. So for freebsd image we
need to enable <code>CloudInit</code>.
</p>
</div>

<div id="outline-container-orga6a107e" class="outline-3">
<h3 id="orga6a107e">Download Image And Convert</h3>
<div class="outline-text-3" id="text-orga6a107e">
<p>
We need packages <code>qemu-utils</code>, <code>wget</code>:
</p>
<pre class="example">
pkg install qemu-utils wget
</pre>

<p>
And download freebsd base image:
</p>
<pre class="example">
base=FreeBSD-11.1-RELEASE-amd64
wget https://download.freebsd.org/ftp/releases/VM-IMAGES/11.1-RELEASE/amd64/Latest/${base}.qcow2.xz
</pre>

<p>
Unzip and convert to raw:
</p>
<pre class="example">
unxz ${base}.qcow2.xz
qemu-img convert -p -f qcow2 -O raw ${base}.qcow2 ${base}.raw
</pre>
</div>
</div>

<div id="outline-container-orge162ac1" class="outline-3">
<h3 id="orge162ac1">Mount Image And Chroot</h3>
<div class="outline-text-3" id="text-orge162ac1">
<p>
Attach to device:
</p>
<pre class="example">
mdconfig -a -t vnode -u 0 -f ${base}.raw
</pre>

<p>
Mount last partition:
</p>
<pre class="example">
mount /dev/md0p3 /mnt
mount -t devfs devfs /mnt/dev
cp /etc/resolv.conf /mnt/etc
chroot /mnt
</pre>
</div>
</div>

<div id="outline-container-orga0f68c7" class="outline-3">
<h3 id="orga0f68c7">Install Cloud-init</h3>
<div class="outline-text-3" id="text-orga0f68c7">
<p>
Install <code>cloud-init</code>:
</p>

<pre class="example">
pkg install py27-cloud-init
</pre>

<p>
Enable services:
</p>
<pre class="example">
cat &gt;&gt; /etc/rc.conf &lt;&lt; EOF
cloudinit_enable="YES"
sshd_enable="YES"
EOF
</pre>

<p>
Cloudinit call <code>blkid</code> to select config drive. But <code>blkid</code> doesn't
work for FreeBSD filesytem. Now work around <code>blkid</code> as below:
</p>
<pre class="example">
cat &gt; /usr/bin/blkid &lt;&lt; EOF
#!/bin/sh
[ -e /dev/iso9660/config-2 ] || exit 1
echo /dev/iso9660/config-2
EOF
chmod a+x /usr/bin/blkid
</pre>

<p>
Mount for cd9660 on FreeBSD does not support <code>-o sync</code>. Patch
cloudinit <code>mount</code>:
</p>
<pre class="example">
cd /usr/local/lib/python2.7/site-packages/cloudinit
patch -p1 &lt;&lt; EOF
--- a/util.py   2017-10-27 07:14:55.968737000 +0000
+++ b/util.py   2017-10-27 07:15:03.481245000 +0000
@@ -1364,6 +1364,7 @@
         if mtypes is None:
             mtypes = ["auto"]
     elif platsys.endswith("bsd"):
+        sync = False
         if mtypes is None:
             mtypes = ['ufs', 'cd9660', 'vfat']
         for index, mtype in enumerate(mtypes):
EOF
</pre>

<p>
Cleanup and exit:
</p>
<pre class="example">
set history = 0
exit
</pre>
</div>
</div>

<div id="outline-container-org4cb7da0" class="outline-3">
<h3 id="org4cb7da0">Umount Image And Convert Back</h3>
<div class="outline-text-3" id="text-org4cb7da0">
<pre class="example">
umount /mnt/dev
rm /mnt/etc/resolv.conf
umount /mnt
mdconfig -d -u 0
qemu-img convert -p -f raw -O qcow2 ${base}.raw ${base}.qcow2
</pre>
</div>
</div>

<div id="outline-container-orge7fae91" class="outline-3">
<h3 id="orge7fae91">Boot Instance</h3>
<div class="outline-text-3" id="text-orge7fae91">
<p>
Once you boot an instance, you can access it via ssh, please notice
the default user is <code>beastie</code>.
</p>
</div>
</div>
</div>


<div id="outline-container-orgbc20c73" class="outline-2">
<h2 id="orgbc20c73">Disk Resize Under FreeBSD</h2>
<div class="outline-text-2" id="text-orgbc20c73">
</div>
<div id="outline-container-orgcd9fc1a" class="outline-3">
<h3 id="orgcd9fc1a">List Disks</h3>
<div class="outline-text-3" id="text-orgcd9fc1a">
<p>
First to list the geoms:
</p>
<pre class="example">
gpart list
=&gt;
Geom name: vtbd0
modified: false
state: CORRUPT
...
</pre>
</div>
</div>

<div id="outline-container-org41cd46d" class="outline-3">
<h3 id="org41cd46d">Show and Recover if Needed</h3>
<div class="outline-text-3" id="text-org41cd46d">
<p>
Show the Geom:
</p>
<pre class="example">
gpart show vtbd0
=&gt;       3  44040315  vtbd0  GPT  (40G) [CORRUPT]
         3       118      1  freebsd-boot  (59K)
       121   2097152      2  freebsd-swap  (1.0G)
   2097273  41943040      3  freebsd-ufs  (20G)
  44040313         5         - free -  (2.5K)
</pre>

<p>
If the <code>state</code> shows <code>CORRUPT</code>, we need to recover it:
</p>
<pre class="example">
gpart recover vtbd0
vtbd0 recovered
</pre>

<p>
Show again and the <code>CORRUPT</code> mark disappeared:
</p>
<pre class="example">
gpart show vtbd0
=&gt;       3  83886069  vtbd0  GPT  (40G)
       3       118      1  freebsd-boot  (59K)
     121   2097152      2  freebsd-swap  (1.0G)
 2097273  41943040      3  freebsd-ufs  (20G)
44040313  39845759         - free -  (19G)
</pre>

<p>
Apparently the partition 3 should be resized.
</p>
</div>
</div>

<div id="outline-container-org418fc14" class="outline-3">
<h3 id="org418fc14">Resize Partition</h3>
<div class="outline-text-3" id="text-org418fc14">
<p>
Run resize on partition 3:
</p>
<pre class="example">
gpart resize -i 3 -a 4k vtbd0
vtbd0p3 resized
gpart show vtbd0
=&gt;       3  83886069  vtbd0  GPT  (40G)
         3       118      1  freebsd-boot  (59K)
       121   2097152      2  freebsd-swap  (1.0G)
   2097273  81788799      3  freebsd-ufs  (39G)
</pre>
</div>
</div>

<div id="outline-container-org0d9444d" class="outline-3">
<h3 id="org0d9444d">Grow Filesystem</h3>
<div class="outline-text-3" id="text-org0d9444d">
<p>
According <a href="https://www.freebsd.org/doc/handbook/disks-growing.html">FreeBSD Doc</a>, <code>growfs</code> should be run as below:
</p>
<pre class="example">
growfs /dev/vtbd0p3
</pre>

<p>
But it doesn't work with below error reported:
</p>
<pre class="example">
growfs: /dev/vtbd0p3: Operation not permitted
</pre>

<p>
A workaround is to run <code>service growfs onestart</code>:
</p>
<pre class="example">
service growfs onestart
Growing root partition to fill device
vtbd0 recovering is not needed
vtbd0p3 resized
super-block backups (for fsck_ffs -b #) at:
 42314112, 43596352, 44878592, 46160832, 47443072, 48725312, 50007552, 51289792, 52572032, 53854272, 55136512,
 56418752, 57700992, 58983232, 60265472, 61547712, 62829952, 64112192, 65394432, 66676672, 67958912, 69241152,
 70523392, 71805632, 73087872, 74370112, 75652352, 76934592, 78216832, 79499072, 80781312
</pre>

<p>
After that I run <code>shutdown -r now</code>, the VM hang at:
</p>
<pre class="example">
run_interrupt_driven_hooks: still waiting after 60 seconds for xpt_config
run_interrupt_driven_hooks: still waiting after 120 seconds for xpt_config
</pre>

<p>
After force restarted it's bootable again.
</p>

<p>
Looks FreeBSD image is not polished well for cloud using.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
